var dataset = [
    {
        "id": "5b152636ccdd4313ab49a5bc1",
        "a": 1,
        "b": "数学",
        "c": "高等数学(1)",
        "d": "91"

    },
    {
        "id": "5b152636ccdd4313ab49a5bc2",
        "a": 2,
        "b": "数学",
        "c": "高等数学(2)",
        "d": "97"

    },
    {
        "id": "5b152636ccdd4313ab49a5bc3",
        "a": 3,
        "b": "数学",
        "c": "线性代数",
        "d": "97"

    },
    {
        "id": "5b152636ccdd4313ab49a5bc4",
        "a": 4,
        "b": "数学",
        "c": "概率论与数理统计",
        "d": "100"

    },
    {
        "id": "5b152636ccdd4313ab49a5bc5",
        "a": 5,
        "b": "数学",
        "c": "离散数学",
        "d": "92"

    },
    {
        "id": "5b152636ccdd4313ab49a5bc6",
        "a": 6,
        "b": "编程语言",
        "c": "高级程序设计语言（C）",
        "d": "98"

    },
    {
        "id": "5b152636ccdd4313ab49a5bc7",
        "a": 7,
        "b": "编程语言",
        "c": "面向对象技术（CPP）",
        "d": "98.5"

    },
    {
        "id": "5b152636ccdd4313ab49a5bc8",
        "a": 8,
        "b": "编程语言",
        "c": "Java程序设计",
        "d": "100"

    },
    {
        "id": "5b152636ccdd4313ab49a5bc9",
        "a": 9,
        "b": "编程语言",
        "c": ".net程序设计（C#）",
        "d": "96"

    },
    {
        "id": "5b152636ccd4313ab49a5bc13",
        "a": 10,
        "b": "算法&数据结构",
        "c": "数据结构",
        "d": "95"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc19",
        "a": 11,
        "b": "算法&数据结构",
        "c": "算法设计与分析",
        "d": "97"
    },

    {
        "id": "5b15263ccdd4313ab49a5bc11",
        "a": 12,
        "b": "计算机理论知识",
        "c": "计算机引论",
        "d": "93.7"

    },
    {
        "id": "5b152636ccdd313ab49a5bc12",
        "a": 13,
        "b": "计算机理论知识",
        "c": "Linux应用与开发",
        "d": "94"
    },

    {
        "id": "5b152636ccdd413ab49a5bc14",
        "a": 14,
        "b": "计算机理论知识",
        "c": "数据库系统",
        "d": "95"
    },
    {
        "id": "5b152636ccdd313ab49a5bc45",
        "a": 15,
        "b": "计算机理论知识",
        "c": "高性能计算",
        "d": "97"
    },
    {
        "id": "5b152636ccdd413ab49a5bc15",
        "a": 16,
        "b": "计算机理论知识",
        "c": "电子技术基础",
        "d": "92.2"
    },
    {
        "id": "5b152636ccdd4313ab9a5bc16",
        "a": 17,
        "b": "计算机理论知识",
        "c": "计算机组成原理",
        "d": "91"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc17",
        "a": 18,
        "b": "计算机理论知识",
        "c": "软件工程",
        "d": "94"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc18",
        "a": 19,
        "b": "计算机理论知识",
        "c": "计算机图形学",
        "d": "95"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc20",
        "a": 20,
        "b": "计算机理论知识",
        "c": "计算机网络",
        "d": "94"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc27",
        "a": 21,
        "b": "课程设计&实训",
        "c": "数据结构课程设计",
        "d": "100"
    },


    {
        "id": "5b152636ccdd4313ab49a5bc21",
        "a": 22,
        "b": "课程设计&实训",
        "c": "java实训",
        "d": "96"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc22",
        "a": 23,
        "b": "课程设计&实训",
        "c": "软件工程应用与实践",
        "d": "99"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc23",
        "a": 24,
        "b": "课程设计&实训",
        "c": "java实训",
        "d": "96"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc24",
        "a": 25,
        "b": "课程设计&实训",
        "c": "数据库系统课程设计",
        "d": "99"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc25",
        "a": 26,
        "b": "课程设计&实训",
        "c": "高级程序设计语言课程设计",
        "d": "88"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc26",
        "a": 27,
        "b": "课程设计&实训",
        "c": "计算机组成原理课程设计",
        "d": "95"
    },
    {
        "id": "5b152636ccdd413ab49a5bc10",
        "a": 28,
        "b": "AI相关",
        "c": "深度学习概率",
        "d": "100"

    },
    {
        "id": "5b152636ccdd4313ab49a5bc28",
        "a": 29,
        "b": "AI相关",
        "c": "数字图像处理",
        "d": "（在读）"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc29",
        "a": 30,
        "b": "AI相关",
        "c": "机器学习",
        "d": "（助教）"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc30",
        "a": 31,
        "b": "英语",
        "c": "CET4",
        "d": "521"
    },
    {
        "id": "5b152636ccdd4313ab49a5bc31",
        "a": 32,
        "b": "英语",
        "c": "CET6",
        "d": "485"
    }
]